test_runs/load/sync/node/artillery_output.txt
vusers.session_length:
  min: ......................................................................... 1154.8
  max: ......................................................................... 1214.8
  median: ...................................................................... 1153.1
  p95: ......................................................................... 1200.1
  p99: ......................................................................... 1200.1


Phase completed: RampUp (index: 1, duration: 30s) 23:59:24(-0300)

Phase started: Plain (index: 2, duration: 120s) 23:59:24(-0300)

--------------------------------------
Metrics for period to: 23:59:20(-0300) (width: 9.952s)
--------------------------------------

http.codes.200: ................................................................ 119
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1619
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1495.5
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 119
vusers.completed: .............................................................. 119
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1156.1
  max: ......................................................................... 1620.5
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1495.5
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 23:59:30(-0300) (width: 9.96s)
--------------------------------------

http.codes.200: ................................................................ 113
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 113
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1624
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1495.5
  p99: ......................................................................... 1620
http.responses: ................................................................ 113
vusers.completed: .............................................................. 113
vusers.created: ................................................................ 113
vusers.created_by_name.sync: ................................................... 113
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.4
  max: ......................................................................... 1626.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1495.5
  p99: ......................................................................... 1620


--------------------------------------
Metrics for period to: 23:59:40(-0300) (width: 9.959s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1151
  max: ......................................................................... 1605
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1157
  max: ......................................................................... 1606
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 23:59:50(-0300) (width: 9.96s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1599
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.8
  max: ......................................................................... 1602.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:00:00(-0300) (width: 9.963s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1597
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.6
  max: ......................................................................... 1599.2
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:00:10(-0300) (width: 9.963s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1599
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1156
  max: ......................................................................... 1601
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:00:20(-0300) (width: 9.963s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1596
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1156.2
  max: ......................................................................... 1597.7
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:00:30(-0300) (width: 9.969s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1595
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1156.5
  max: ......................................................................... 1597.7
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:00:40(-0300) (width: 9.959s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1155
  max: ......................................................................... 1598
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1157.4
  max: ......................................................................... 1600.2
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:00:50(-0300) (width: 9.959s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1597
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.6
  max: ......................................................................... 1599.1
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:01:00(-0300) (width: 9.961s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1154
  max: ......................................................................... 1598
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.7
  max: ......................................................................... 1612.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


--------------------------------------
Metrics for period to: 00:01:10(-0300) (width: 9.961s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1150
  max: ......................................................................... 1599
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.2
  max: ......................................................................... 1607.1
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


Phase completed: Plain (index: 2, duration: 120s) 00:01:24(-0300)

Phase started: Cleanup (index: 3, duration: 15s) 00:01:24(-0300)

--------------------------------------
Metrics for period to: 00:01:20(-0300) (width: 9.962s)
--------------------------------------

http.codes.200: ................................................................ 120
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 120
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1595
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 120
vusers.completed: .............................................................. 120
vusers.created: ................................................................ 120
vusers.created_by_name.sync: ................................................... 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1154.9
  max: ......................................................................... 1599.4
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


Phase completed: Cleanup (index: 3, duration: 15s) 00:01:39(-0300)

--------------------------------------
Metrics for period to: 00:01:30(-0300) (width: 6.113s)
--------------------------------------

http.codes.200: ................................................................ 73
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 1153
  max: ......................................................................... 1597
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 73
vusers.completed: .............................................................. 73
vusers.created: ................................................................ 60
vusers.created_by_name.sync: ................................................... 60
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1155.2
  max: ......................................................................... 1598.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9


All VUs finished. Total time: 3 minutes, 18 seconds

--------------------------------
Summary report @ 00:01:40(-0300)
--------------------------------

http.codes.200: ................................................................ 1877
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 1877
http.response_time:
  min: ......................................................................... 1150
  max: ......................................................................... 1624
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 1877
vusers.completed: .............................................................. 1877
vusers.created: ................................................................ 1877
vusers.created_by_name.sync: ................................................... 1877
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1154.8
  max: ......................................................................... 1626.8
  median: ...................................................................... 1300.1
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9